Revit 2024 API
BuiltInFailures.SketchFailures.InvalidCropAreaSketchRegen Property
 Crop area sketch can either be empty or include one closed, not self-intersecting loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidCropAreaSketchRegen { get; }
Visual Basic
Public Shared ReadOnly Property InvalidCropAreaSketchRegen As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidCropAreaSketchRegen {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace